<?php

if ($_POST['titlo'] == "1")
	{include ("titlo1.php");}
elseif ($_POST['titlo'] == "2")
	{include ("titlo2.php");}
if ($_POST['akzente_entfernen'] == "1" OR $_POST['akzente_entfernen'] == "2")
	{include ("titlo0.php");}
include ("vereinigung.php");


$ou = array(
"оу" => "у", 
"Оу" => "У", 
"ОУ" => "У", );
if ($_POST['ou'] == "2")
	{
	$text = strtr($text, $ou);
	}

$cu_alalc = array(
"А" => "A", 
"а" => "a", 
"Б" => "B", 
"б" => "b", 
"В" => "V", 
"в" => "v", 
"Г" => "G", 
"г" => "g", 
"Д" => "D", 
"д" => "d", 
"Е" => "E", 
"е" => "e", 
"Є" => "E", 
"є" => "e", 
"Ё" => "Ë", 
"ё" => "ë", 
"Ж" => "Zh", 
"ж" => "zh", 
"Ѕ" => "Ż", 
"ѕ" => "ż", 
"Ꙃ" => "Ż",  // unsicher
"ꙃ" => "ż", 
"З" => "Z", 
"з" => "z", 
"Ʒ" => "Z", 
"ӡ" => "z", 
"Ꙁ" => "Z", 
"ꙁ" => "z", 
"И" => "I", 
"и" => "i", 
"Й" => "Ĭ", 
"й" => "ĭ", 
"І" => "Ī", 
"і" => "ī", 
"Ї" => "І", 
"ї" => "і", 
"ћ" => "Ǵ", 
"Ћ" => "ǵ", 
"К" => "K", 
"к" => "k", 
"Л" => "L", 
"л" => "l", 
"М" => "M", 
"м" => "m", 
"Н" => "N", 
"н" => "n", 
"О" => "O", 
"о" => "o", 
"Ъ" => "ʺ", 
"ъ" => "ʺ", 
"Ѡ" => "Ō", 
"ѡ" => "ō", 
"Ѿ" => "Ō͡T", 
"ѿ" => "ō͡t", 
"Ѻ" => "O", 
"ѻ" => "o", 
"П" => "P", 
"п" => "p", 
"Р" => "R", 
"р" => "r", 
"С" => "S", 
"с" => "s", 
"Т" => "T", 
"т" => "t", 
"У" => "U", 
"у" => "u", 
"Ꙋ" => "Ū", 
"ꙋ" => "ū", 
"Ѹ" => "U", 
"ѹ" => "u", 
"Ф" => "F", 
"ф" => "f", 
"Х" => "Kh", 
"х" => "kh", 
"Ц" => "T͡S", 
"ц" => "t͡s", 
"Ч" => "Ch", 
"ч" => "ch", 
"Ш" => "Sh", 
"ш" => "sh", 
"Ь" => "ʹ", 
"ь" => "ʹ", 
"Ы" => "Ȳ", 
"ы" => "ȳ", 
"Ꙑ" => "Y", 
"ꙑ" => "y", 
"Ѣ" => "Ě", 
"ѣ" => "ě", 
"Ꙓ" => "I͡Ě", 
"ꙓ" => "i͡ě", 
"Э" => "Ė", 
"э" => "ė", 
"Ю" => "I͡U", 
"ю" => "i͡u", 
"Ѫ" => "Ǫ", 
"ѫ" => "ǫ", 
"Ѭ" => "I͡Ǫ", 
"ѭ" => "i͡ǫ", 
"Ꙗ" => "I͡A", 
"ꙗ" => "i͡a", 
"Ѧ" => "Ę", 
"ѧ" => "ę", 
"Ѩ" => "I͡Ę", 
"ѩ" => "i͡ę", 
"Ѥ" => "I͡E", 
"ѥ" => "i͡e", 
"Ѯ" => "K͡S", 
"ѯ" => "k͡s", 
"Ѱ" => "P͡S", 
"ѱ" => "p͡s", 
"Я" => "I͡A", 
"я" => "i͡a", 
"Ѵ" => "", 
"ѵ" => "", 
"Ѷ" => "Ẏ", 
"ѷ" => "ẏ", 
"Ҁ" => "90", 
"ҁ" => "90", 
"Њ" => "Nʹ", 
"њ" => "nʹ", 
"Љ" => "Lʹ", 
"љ" => "lʹ",
"Н҄" => "Nʹ",
"Р҄" => "Rʹ",
"Л҄" => "Lʹ",
"н҄" => "nʹ",
"р҄ " => "rʹ",
"л҄" => "lʹ",
 ); 
$text = strtr($text, $cu_alalc);


$ikratkoe = array(
"Ī" => "Ĭ", 
"ĭ" => "ĭ", );

if ($_POST['ikratkoe'] == "0")
	{
	$text = strtr($text, $ikratkoe);
	}

$cu_alalc_shch  = array(
"щ" => "shch", 
"Щ" => "Shch", );

$cu_alalc_sht  = array(
"щ" => "sht", 
"Щ" => "Sht", );

if ($_POST['schtsch'] == "2")
	{
	$text = strtr($text, $cu_alalc_shch);
	}
else
	{
	$text = strtr($text, $cu_alalc_sht);
	}

$theta1  = array(
"Ѳ" => "Ḟ",
"ѳ" => "ḟ", );

$theta2  = array(
"Ѳ" => "Θ", 
"ѳ" => "θ",  );

$theta3  = array(
"Ѳ" => "Th", 
"ѳ" => "th",  );

$theta4  = array(
"Ѳ" => "T", 
"ѳ" => "t",  );


if ($_POST['theta'] == "2")
	{
	$text = strtr($text, $theta2);
	}
elseif ($_POST['theta'] == "3")
	{
	$text = strtr($text, $theta3);
	}
elseif ($_POST['theta'] == "4")
	{
	$text = strtr($text, $theta4);
	}
else
	{
	$text = strtr($text, $theta1);
	}

$text = preg_replace('{Ъ$|Ъ\s}',' ', $text);
$text = preg_replace('{ъ$|ъ\s}',' ', $text);
?>
