<?php
 /* to-do
 - \u-Problem beseitigen, vielleicht mit £$€?
 - diakritika und interpunktion an andere maps anpassen
*/

$hip_cu = array(

	"jь" => "\u0463",  # additional chars mapped to the same location in both modes
	"Jь" => "\u0462", 
	"JЬ" => "\u0462",  # Yat
	"<кс>" => "\u046F",  
	"<КС>" => "\u046E", 
	"<Кс>" => "\u046E",  #  КСИ of both modes
	"ju" => "\u046D",  #             ЙОТИРОВАННЫЙ ЮС БОЛЬШОЙ (these two are used in Old Bulgarian)
	"<е>" => "\u0454", 
	"<Е>" => "\u0404",  #   украинское ЙЕ or the large EST in Slavonic
	"vʺ" => "\u0477", 
	"Vʺ" => "\u0476", 
	"<i>" => "\u0456",   
	"_i" => "і",
	"_I" => "І",
//	"_i" => "\uF8FF",  # numeric i is taken to private use and replaced below
	"i" => "\u0456", 
	"<i_>" => "\uA647", 
	"<е>" => "\u0454", 
	"_е" => "\u0454", 
	"_Е" => "\u0404", 
	"<Е>" => "\u0404", 
	"_кс" => "\u046F", 
	"_КС" => "\u046E", 
	"_Кс" => "\u046E", 
	"<кс>" => "\u046F", 
	"<КС>" => "\u046E", 	
	"<Кс>" => "\u046E", 
	"<о>" => "\u047B", 
	"<О>" => "\u047A", 
	"_о" => "\u047B", 
	"_О" => "\u047A", 
	"w\т" => "\u047F", 
	"W\т" => "\u047E", 
	"W\Т" => "\u047E", 
	"<w>" => "\u047D", 
	"<W>" => "\u047C", 
	"_w" => "\u047D", 
	"_W" => "\u047C", 
	"<пс>" => "\u0471", 
	"<ПС>" => "\u0470", 
	"<Пс>" => "\u0470", 
	"_пс" => "\u0471", 
	"_ПС" => "\u0470", 
	"_Пс" => "\u0470", 
	"<у>" => "\u0443", 
	"_у" => "\u0443", 
	"о<у>" => "\u043E" . "\u0443", 
	"о_у" => "\u0479", 
	"О<у>" => "\u041E" . "\u0443", 
	"О_у" => "\u0478", 



	"jа" => "\uA657", 
	"JА" => "\uA656", 
	"Jа" => "\uA656", 

//	"<а>" => "?", # sending az variant to alpha ?
	"<г>" => "\u0491", 
	"<Г>" => "\u0490", 
	"<д>" => "\u0434" . "\uFE00",  
#	"д_"  => chr(0x0434" . "\uFE00", 
	"<дг>" => "\uA663", 
	"<ДГ>" => "\uA662", 
	"<дж>" => "\u045F", 
	"<ДЖ>" => "\u040F", 
	"jе" => "\u0465", 
	"JЕ" => "\u0464", 
	"Jе" => "\u0464", 
	"jjь" => "\uA653", 
	"JJЬ" => "\uA652", 
	"<jь>" => "\u0463" . "\uFE00", 
	"</jь>" => "\u0463",  # we do not know what the Yat' with a slash is
	"<sг>" => "\uA643",  
	"<s->" => "\uA643",  # undocumented
	"<s>" => "\uA645",  
	"<з>" => "\uA641", 

	"<лг>" => "\uA665", 
	"<нг>" => "\u04A5", 
	"<оо>" => "\uA699",  
	"<о+>" => "\uA69B", 
	"<о.о.>" => "\uA66D", 
	"<о.>" => "\uA669", 
	"<о:>" => "\uA66B", 
	"<о_>" => "\u043E" . "\uFE00", 
#	"о_" => "\u043E" . "\uFE00", 
	"<_w>" => "\uA64D", 
	"<с>" => "\u0441" . "\uFE00",  #            СЛОВО (крупное начертание, вылезающее под строку)
	"<т>" => "\u0442" . "\uFE00",  #            ТВЕРДО (высокое начертание)
	"<|т|>" => "\u0442" . "\uFE01",  #           ТВЕРДО (трехмачтовое начертание)
  	"<оv>" => "\uA64B" . "\uFE00", 
#  	"<ц>" => "\u045F",  #            ЦЫ (ч-образное или у-образное начертание)
  	"<ч>" => "\u0447",  #            ЧЕРВЬ (чашеобразное начертание)

 # 	"<щ>" => "\u0449",  #            ЩА (ШТА",  вместо 3-й ножки чашеобразное Ч
 	"<ъ>" => "\u044A" . "\uFE00", 
 #	"ъ_"  => chr(0x044A" . "\uFE00",  #            ЕР (высокое начертание)
	"<ы>" => "\uA651",     #   ЕРЫ (в виде ЪI)
	"<ьi_>" => "\u044C" . "\uA647",  #      ЕРЫ (в виде ЬL)
	"<ъi_>" => "\u044A" . "\uA647",  #          ЕРЫ (в виде ЪL)
	"<ьи>" => "\u044C" . "\u0438",  #          ЕРЫ (в виде ЬИ)
	"<ъи>" => "\u044A" . "\u0438",  #         ЕРЫ (в виде ЪИ)
//	"<ь-i>" => "?", #         ЕРЫ (в виде ЬI с соединительной черточкой)
//	"<ъ-i>" => "?",  #       ЕРЫ (в виде ЪI с соединительной черточкой)
//	"<ь-i_>" => "?",  #      ЕРЫ (в виде ЬL с соединительной черточкой)
//	"<ъ-i_>" => "?",   #     ЕРЫ (в виде ЪL с соединительной черточкой)
//	"<ь-и>" => "?",    #     ЕРЫ (в виде ЬИ с соединительной черточкой)
//	"<ъ-и>" => "?",    #     ЕРЫ (в виде ЪИ с соединительной черточкой)

	"<ю>" => "\uA655",  #         Ю (зеркальное начертание)
	"ю\@" => "\u044E" . "\u0306",  #         Ю КРАТКОЕ старой молдавской (румынской) печати

	"<jа>" => "\uA657",  #          Я (в виде "лигатуры" IА с соединением посредине)
	"jя" => "\u0469",  #            ЙОТИРОВАННЫЙ ЮС МАЛЫЙ
  	"<яu>" => "\uA65B",  #           ТРЕТИЙ ЮС (ЮС БОЛЬШОЙ, низ которого нарисован как ЮС МАЛЫЙ)
//	"<я.>" => "?", #           ЮС МАЛЫЙ (в виде A с "прогнутой вниз" гориз. линией)
	"<я>" => "\uA659",  #           ЮС МАЛЫЙ (начертание в виде подчеркнутой "A")
//	"<я_>" => "?", #           ЮС МАЛЫЙ (начертание с соединенными внизу чертой ножками)
//	"<u>" => "?", #            ЮС БОЛЬШОЙ (с двумя ножками вместо трех)
	"<ын>" => "\uA65F",  #          молдавская (румынская) юсовая буква в виде /|\
	"=" => "\u0486", 
	"'" => "\u0301",  
	"ʹ" => "\u0301",  
	"^" => "\u0311",  
	"`" => "\u0300", 
	"~" => "\u0483", 
	"\"" => "\u030F", 
	"\ъ" => "\u033E", 
	"\Ъ" => "\u033E", 
	"\б" => "\u2DE0" . "\u0487", 
	"\Б" => "\u2DE0" . "\u0487", 
	"\в" => "\u2DE1" . "\u0487", 
	"\В" => "\u2DE1" . "\u0487", 
	"\г" => "\u2DE2" . "\u0487", 
	"\Г" => "\u2DE2" . "\u0487", 
	"\д" => "\u2DE3", 
	"\Д" => "\u2DE3", 
	"\ж" => "\u2DE4", 
	"\Ж" => "\u2DE4", 
	"\з" => "\u2DE5", 
	"\З" => "\u2DE5", 
	"\к" => "\u2DE6" . "\u0487", 
	"\К" => "\u2DE6" . "\u0487", 
	"\л" => "\u2DE7" . "\u0487", 
	"\Л" => "\u2DE7" . "\u0487", 
	"\м" => "\u2DE8", 
	"\М" => "\u2DE8", 
	"\н" => "\u2DE9" . "\u0487", 
	"\Н" => "\u2DE9" . "\u0487", 
	"\о" => "\u2DEA" . "\u0487", 
	"\О" => "\u2DEA" . "\u0487", 
	"\п" => "\u2DEB", 
	"\П" => "\u2DE8", 
	"\р" => "\u2DEC" . "\u0487", 
	"\Р" => "\u2DEC" . "\u0487", 
	"\с" => "\u2DED", 
	"\С" => "\u2DED",  
	"\т" => "\u2DEE", 
	"\Т" => "\u2DEE", 
	"\х" => "\u2DEF", 
	"\Х" => "\u2DEF", 
	"\ц" => "\u2DF0", 
	"\Ц" => "\u2DF0", 
	"\ч" => "\u2DF1" . "\u0487", 
	"\Ч" => "\u2DF1" . "\u0487", 
	"\ш" => "\u2DF2" . "\u0487", 
	"\Ш" => "\u2DF2" . "\u0487", 
	"\щ" => "\u2DF3" . "\u0487", 
	"\Щ" => "\u2DF3" . "\u0487", 
	"\f" => "\u2DF4" . "\u0487", 
	"\F" => "\u2DF4" . "\u0487", 
	"\а" => "\u2DF6" . "\u0487", 
	"\А" => "\u2DF6" . "\u0487", 
	"\е" => "\u2DF7", 
	"\Е" => "\u2DF7", 
	"\g" => "\u2DF8", 
	"\G" => "\u2DF8", 
	"\у" => "\u2DF9", 
	"\У" => "\u2DF9", 
	"\jе" => "\u2DFA", 
	"\ю" => "\u2DFB", 
	"\Ю" => "\u2DFB", 
	"\jа" => "\u2DFC", 
	"\я" => "\u2DFD", 
	"\Я" => "\u2DFD", 
	"\u" => "\u2DFE", 
	"\U" => "\u2DFE", 
	"\ju" => "\u2DFF", 
	"\и" => "\uA675", 
	"\И" => "\uA675", 
	"\^" => "\u0487", 
	"\-" => "\u0487", 
	"#" => "\u0482", 
	"@" => "\uA67E", 
	"+" => "\u2020", 
	"*" => "\uA673", 
	"<*>" => "\uA673", 
	"<М\р>" => "\u1F545", 
	"<+>" => "\u1F542", 
	"<\+/>" => "\u1F541", 
	"<(+)>" => "\u1F540", 
	"<(:.>" => "\u1F543", 
	"<.:)>" => "\u1F544", 
	"<тьматем>" => "\u0430" . "\uA672", 
	"<->" => "\u2011",
	"<>"   => $newline,
	"_/"   => $newline,
	"<_>"  => " ",
	"__"   => " ",
	"\­"   => "\u0483", // anscheinend Fehler http://azbyka.ru/biblia/?Mt.5&hip
//	"­"   => "", // discretionary hyphen
//	"\u0441"   => "", // discretionary hyphen
	"<|>"  => "\u034F", # combining grapheme joiner
	"&"    => "\u200D", # zero width joiner
	"%-"   => "-",
	"<((>" => "\u00AB",
	"<))>" => "\u(0x00BB",
	"%<"  => "",
	"%>"  => "",
	"%["  => "",
	"%]"  => "",
	"%("  => "",
	"%)"  => "", # I.E., all formatting information is lost
/*	"%<"  => "<RED>",
	"%>"  => "</RED>",
	"%["  => "<WIDE>",
	"%]"  => "</WIDE>",
	"%("  => "<SMALL>",
	"%)"  => "</SMALL>"); */



	"а" => "\u0430",  # the 32 letters of the alphabet and their latinate conjugates
	"А" => "\u0410", 
	"б" => "\u0431", 
	"Б" => "\u0411", 
	"в" => "\u0432", 
	"В" => "\u0412", 
	"г" => "\u0433", 
	"Г" => "\u0413", 
	"д" => "\u0434", 
	"Д" => "\u0414", 
	"е" => "\u0435", 
	"Е" => "\u0415", 
	"ж" => "\u0436", 
	"Ж" => "\u0416", 
	"з" => "\u0437", 
	"З" => "\u0417", 
	"и" => "\u0438", 
	"И" => "\u0418", 
	"й" => "\u0439", 
	"Й" => "\u0419", 
	"к" => "\u043A", 
	"К" => "\u041A", 
	"л" => "\u043B", 
	"Л" => "\u041B", 
	"м" => "\u043C", 
	"М" => "\u041C", 
	"н" => "\u043D", 
	"Н" => "\u041D", 
	"о" => "\u043E", 
	"О" => "\u041E", 
	"п" => "\u043F", 
	"П" => "\u041F", 
	"р" => "\u0440", 
	"Р" => "\u0420", 
	"с" => "\u0441", 
	"С" => "\u0421", 
	"т" => "\u0442", 
	"Т" => "\u0422", 
	"ф" => "\u0444", 
	"Ф" => "\u0424", 
	"х" => "\u0445", 
	"Х" => "\u0425", 
	"ц" => "\u0446", 
	"Ц" => "\u0426", 
	"ч" => "\u0447", 
	"Ч" => "\u0427", 
	"ш" => "\u0448", 
	"Ш" => "\u0428", 
	"щ" => "\u0449", 
	"Щ" => "\u0429", 
	"ъ" => "\u044A", 
	"Ъ" => "\u042A", 
	"ы" => "\u044B", 
	"Ы" => "\u042B", 
	"ь" => "\u044C", 
	"Ь" => "\u042C", 
	"ю" => "\u044E", 
	"Ю" => "\u042E", 
	"s" => "\u0455", 
	"S" => "\u0405",  # Either Zelo (slav) or Macedonian Z (civil)
	"v" => "\u0475", 
	"V" => "\u0474",  # Izhitsa (without accents)
	"f" => "\u0473", 
	"F" => "\u0472",  # Theta in both modes
//	"u" => "\u046B",  #           ЮС БОЛЬШОЙ
	"w" => "\u0461", 
	"W" => "\u0460", 
	"у" => "\uA64B", 
	"У" => "\uA64A", 
	"я" => "\u0467", 
	"Я" => "\u0466",  
	"g" => "\uA649",  
  	"q" =>  "\u0481", 
	"э" => "\u044D",  
	"Э" => "\u042D", 
	"I" => "\u0406",
); 

$text = strtr($text, $hip_cu);
$text = json_encode($text);
$text = str_replace('\\\\', '\\', $text);
$text = json_decode($text);
$text = str_replace('U', 'Ѫ', $text);
$text = str_replace('u', 'ѫ', $text);

if ($_POST['titlo'] == "2")
	{
	include ("abk_cu.php");
	}
if($_POST['zieltext'] == "isor9")
	{
	include ("cu-isor9.php");
	include ("vereinigung.php");
	}
if($_POST['zieltext'] == "alalc")
	{
	include ("cu-alalc.php");
	include ("vereinigung.php");
	}
if($_POST['zieltext'] == "ru_1700_1918")
	{
	include ("cu-ru_1700_1918.php");
	include ("vereinigung.php");
	}
?>
